{"text": "Q 1. What is object-oriented programming (OOPs)? Object-Oriented Programming (OOP) is a programming paradigm that organizes code into objects, which are instances of classes. It focuses on encapsulating data and behavior together, promoting modularity and reusability. Ans: Q 2. What is encapsulation? Encapsulation is the concept of bundling data (attributes) and methods (functions) that operate on that data into a single unit (class). It hides the internal details of an object and provides controlled access through methods. Ans: Q 3. What is inheritance? Inheritance is a mechanism where a new class (subclass or derived class) inherits properties and behaviors from an existing class (superclass or base class). It promotes code reuse and supports hierarchical relationships. Ans: 01", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 2, "chunk_index": 0}}
{"text": "Q 4. What is polymorphism? Polymorphism allows objects of different classes to be treated as instances of a common superclass. It enables methods to be invoked on objects without knowing their specific types, as long as they adhere to the common interface. Ans: 02 Q 5. What is a constructor? A constructor is a special method that is automatically called when an object is created. It initializes the object's attributes and prepares the object for use. Constructors often have the same name as the class. Ans:", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 3, "chunk_index": 1}}
{"text": "Method overriding is the process by which a subclass provides a specific implementation for a method that is already defined in its superclass. The overridden method in the subclass has the same name, return type, and parameters. Q 6. What is method overloading? Method overloading is the ability to define multiple methods in a class with the same name but different parameter lists. The methods are differentiated based on the number or types of parameters they accept. Ans: 03 Q 7. What is method overriding? Ans: Q 8. What is an abstract class? An abstract class is a class that cannot be instantiated on its own. It may contain abstract methods (methods without a body) that must be implemented by its concrete subclasses. Abstract classes provide a common interface. Ans:", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 4, "chunk_index": 2}}
{"text": "Q 9. What is an interface? An interface is a contract that defines a set of methods that a class must implement. It allows multiple classes to adhere to the same interface, promoting a form of multiple inheritance. Interfaces only declare method signatures, not implementations. Ans: 04 Q 10.What is a static method? A static method belongs to the class itself, not to instances of the class. It can be called using the class name and is often used for utility functions or operations that don't require instance-specific data. Ans:", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 5, "chunk_index": 3}}
{"text": "Q 11. What is a final class? A final class is a class that cannot be subclassed. It prevents other classes from extending it and inheriting its behavior. Ans: 05 Q 12. What is composition? Composition is a design principle where a class contains objects of other classes as part of its attributes. It allows creating complex structures by combining simpler classes. Ans: Q 13. What is a super keyword? The super keyword is used to refer to the parent class or superclass. It can be used to call methods and constructors from the superclass. Ans:", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 6, "chunk_index": 4}}
{"text": "Q 14. What is method hiding? Method hiding is a concept in object-oriented programming where a subclass defines a method with the same name as a method in its superclass, but the subclass method doesn't override the superclass method. Instead, it creates a new, independent method with the same name. This can lead to confusion and unexpected behavior, so it's generally recommended to use method overriding instead. Ans: 06 Q 15. What is a constructor chaining? Constructor chaining is the process of calling one constructor from another within the same class or between a superclass and a subclass. It allows for code reuse and efficient initialization. Ans:", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 7, "chunk_index": 5}}
{"text": "1 0 0 % P L A C E M E N T A S S I S T A N C E 1 : 1 P E R S O N A L M E N T O R S H I P F R O M I N D U S T R Y E X P E R T S 2 0 0 + S U C C E S S F U L A L U M N I 1 4 7 % ( A V G . ) S A L A R Y H I K E 1 0 0 % S U C C E S S R A T E 2 3 L P A ( A V G . ) C T C L E A R N F R O M S C R A T C H C A R E E R S E R V I C E S W h y C h o o s e A lg o T u to r? + 9 1 - 7 2 6 0 0 5 8 0 9 3 in f o @ a lg o t u t o r .iow w w .a lg o t u t o r .io E X P L O R E M O R E", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 8, "chunk_index": 6}}
{"text": "The diamond problem occurs in languages that support multiple inheritance, where a class inherits from two classes that have a common base class. This can lead to ambiguity in method resolution. Some languages provide mechanisms to handle this, like virtual inheritance. Q 16. What is the diamond problem in multiple inheritance? Ans: 07 A shallow copy copies the references of objects contained within an object, while a deep copy creates new instances of the objects contained. A deep copy results in a completely independent copy of the original object and its contained objects. Q 17. What is a shallow copy and a deep copy? Ans:", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 9, "chunk_index": 7}}
{"text": "A virtual method is a method declared in a base class that can be overridden by its subclasses. The actual implementation invoked is determined by the runtime type of the object, supporting polymorphism. Q 18. What is a virtual method? Ans: 08 Java achieves multiple inheritance through interfaces. A class can implement multiple interfaces, allowing it to inherit multiple sets of method declarations. Q 19. How does Java achieve multiple inheritance? Ans: The final keyword can be applied to classes, methods, and variables. A final class cannot be subclassed, a final method cannot be overridden, and a final variable cannot be reassigned after its initial assignment. Q 20. What is the purpose of the final keyword in Java? Ans: DSA with System Design (HLD + LLD) DSA & System Design with Full Stack Advanced Data Science & Machine Learning MERN Full Stack Web Development Wan t to up your Skill? Join o ur Popular courses", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 10, "chunk_index": 8}}
{"text": "The SOLID principle is an acronym for a set of design principles that promote maintainable and scalable code: Q 21. What is the SOLID principle? Ans: 09 An abstract class can have both abstract and concrete methods, while an interface only has method signatures (no method implementations). A class can implement multiple interfaces, but it can inherit from only one abstract class. Q 22. What is the difference between an abstract class and an interface? Ans:", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 11, "chunk_index": 9}}
{"text": "Q 23. How is encapsulation related to data hiding? Ans: 10 Inheritance creates a relationship between a subclass and a superclass, allowing the subclass to inherit properties and methods. Composition involves creating an object within another object to achieve complex behavior without the tight coupling of inheritance. Q 24. What is the difference between composition and inheritance? Ans: In C++, a destructor is a special method with the same name as the class, preceded by a tilde (~). It is called when an object is about to be destroyed, allowing for cleanup tasks such as releasing resources or memory. Q 25. What is the role of a destructor in C++? Ans: Encapsulation involves bundling data and methods together. Data hiding is the practice of making the internal data of an object inaccessible to the outside world, except through well-defined methods. Encapsulation helps achieve data hiding.", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 12, "chunk_index": 10}}
{"text": "07", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 13, "chunk_index": 11}}
{"text": "+ 9 1 - 7 2 6 0 0 5 8 0 9 3 i n f o @ a l g o t u t o r .i ow w w .a l g o t u t o r .i o", "metadata": {"filename": "OOPS Important Interview Questions.pdf", "page_number": 14, "chunk_index": 12}}
